import { makeSentence } from './factory';

export const lesson10Sentences = [
  makeSentence(10, 1, '近くにコンビニがあります。', 'ちかくにこんびにがあります。', '附近有便利店。', '近くに＿＿があります。', ['コンビニ'], ['v-0512', 'v-0499', 'v-0500']),
  makeSentence(10, 2, 'コンビニの中にエーティーエムがあります。', 'こんびにのなかにえーてぃーえむがあります。', '便利店里面有自动柜员机。', 'コンビニの中に＿＿があります。', ['エーティーエム'], ['v-0499', 'v-0509', 'v-0505', 'v-0500']),
  makeSentence(10, 3, '箱の中に猫がいます。', 'はこのなかにねこがいます。', '箱子里面有一只猫。', '箱の中に＿＿がいます。', ['猫', 'ねこ'], ['v-0508', 'v-0509', 'v-0507', 'v-0501']),
  makeSentence(10, 4, '公園に男の人がいます。', 'こうえんにおとこのひとがいます。', '公园里有一名男子。', '公園に＿＿がいます。', ['男の人', 'おとこのひと'], ['v-0522', 'v-0506', 'v-0501']),
  makeSentence(10, 5, '喫茶店はコンビニの隣です。', 'きっさてんはこんびにのとなりです。', '咖啡店在便利店旁边。', '喫茶店はコンビニの＿＿です。', ['隣', 'となり'], ['v-0525', 'v-0499', 'v-0524']),
  makeSentence(10, 6, 'ポストはビルの前にあります。', 'ぽすとはびるのまえにあります。', '邮筒在大楼前面。', 'ポストはビルの＿＿にあります。', ['前', 'まえ'], ['v-0528', 'v-0521', 'v-0513', 'v-0500']),
  makeSentence(10, 7, 'スイッチはドアの右にあります。', 'すいっちはどあのみぎにあります。', '开关在门的右边。', 'スイッチはドアの＿＿にあります。', ['右', 'みぎ'], ['v-0530', 'v-0529', 'v-0526', 'v-0500']),
  makeSentence(10, 8, '冷蔵庫の中に牛乳があります。', 'れいぞうこのなかにぎゅうにゅうがあります。', '冰箱里有牛奶。', '冷蔵庫の中に＿＿があります。', ['牛乳', 'ぎゅうにゅう'], ['v-0534', 'v-0509', 'v-0500']),
  makeSentence(10, 9, 'テーブルの上に本があります。', 'てーぶるのうえにほんがあります。', '桌子上有书。', 'テーブルの上に＿＿があります。', ['本', 'ほん'], ['v-0538', 'v-0537', 'v-0500']),
  makeSentence(10, 10, '家の後ろに犬がいます。', 'いえのうしろにいぬがいます。', '房子后面有一只狗。', '家の後ろに＿＿がいます。', ['犬', 'いぬ'], ['v-0541', 'v-0542', 'v-0501'])
];
