import { makeSentence } from './factory';

export const lesson03Sentences = [
  makeSentence(3, 1, 'ここは食堂です。', 'ここはしょくどうです。', '这里是食堂。', 'ここは＿＿です。', ['食堂', 'しょくどう'], ['v-0093', 'v-0094']),
  makeSentence(3, 2, 'トイレはどこですか。', 'といれはどこですか。', '厕所在哪里？', 'トイレは＿＿ですか。', ['どこ'], ['v-0098', 'v-0101']),
  makeSentence(3, 3, '会議室はあそこです。', 'かいぎしつはあそこです。', '会议室在那里。', '会議室は＿＿です。', ['あそこ'], ['v-0102', 'v-0096']),
  makeSentence(3, 4, '受付はこちらです。', 'うけつけはこちらです。', '接待处在这边。', '受付は＿＿です。', ['こちら'], ['v-0129', 'v-0134']),
  makeSentence(3, 5, 'エレベーターはどちらですか。', 'えれべーたーはどちらですか。', '电梯在哪边？', 'エレベーターは＿＿ですか。', ['どちら'], ['v-0095', 'v-0104']),
  makeSentence(3, 6, '靴売り場は二階です。', 'くつうりばはにかいです。', '鞋类卖场在二楼。', '靴売り場は＿＿です。', ['二階', 'にかい'], ['v-0107', 'v-0120', 'v-0123']),
  makeSentence(3, 7, 'このネクタイはいくらですか。', 'このねくたいはいくらですか。', '这条领带多少钱？', 'このネクタイは＿＿ですか。', ['いくら'], ['v-0138', 'v-0110']),
  makeSentence(3, 8, 'ワインをください。', 'わいんをください。', '请给我葡萄酒。', '＿＿をください。', ['ワイン', 'わいん'], ['v-0119', 'v-0115']),
  makeSentence(3, 9, 'お手洗いは一階です。', 'おてあらいはいっかいです。', '洗手间在一楼。', 'お手洗いは＿＿です。', ['一階', 'いっかい'], ['v-0099', 'v-0123']),
  makeSentence(3, 10, '会社は大阪です。', 'かいしゃはおおさかです。', '公司在大阪。', '会社は＿＿です。', ['大阪', 'おおさか'], ['v-0147', 'v-0146'])
];
