import { makeSentence } from './factory';

export const lesson07Sentences = [
  makeSentence(7, 1, '友達に花をあげます。', 'ともだちにはなをあげます。', '送花给朋友。', '友達に花を＿＿。', ['あげます'], ['v-0337', 'v-0338']),
  makeSentence(7, 2, '母にプレゼントをあげました。', 'ははにぷれぜんとをあげました。', '送了礼物给母亲。', '母に＿＿をあげました。', ['プレゼント'], ['v-0372', 'v-0360', 'v-0338']),
  makeSentence(7, 3, '父からメールをもらいました。', 'ちちからめーるをもらいました。', '收到了父亲的邮件。', '父からメールを＿＿。', ['もらいました'], ['v-0373', 'v-0340', 'v-0339']),
  makeSentence(7, 4, '鋏で紙を切ります。', 'はさみでかみをきります。', '用剪刀剪纸。', '鋏で紙を＿＿。', ['切ります', 'きります'], ['v-0363', 'v-0361', 'v-0362']),
  makeSentence(7, 5, '箸でご飯を食べます。', 'はしでごはんをたべます。', '用筷子吃饭。', '＿＿でご飯を食べます。', ['箸', 'はし'], ['v-0354']),
  makeSentence(7, 6, '友達に切符をもらいました。', 'ともだちにきっぷをもらいました。', '从朋友那里得到了车票。', '友達に＿＿をもらいました。', ['切符', 'きっぷ'], ['v-0344', 'v-0339']),
  makeSentence(7, 7, '先生に日本語を習います。', 'せんせいににほんごをならいます。', '向老师学习日语。', '先生に日本語を＿＿。', ['習います', 'ならいます'], ['v-0376']),
  makeSentence(7, 8, '友達にパソコンを借ります。', 'ともだちにぱそこんをかります。', '向朋友借电脑。', '友達にパソコンを＿＿。', ['借ります', 'かります'], ['v-0336', 'v-0375']),
  makeSentence(7, 9, '家族に荷物を送ります。', 'かぞくににもつをおくります。', '给家人寄行李。', '家族に荷物を＿＿。', ['送ります', 'おくります'], ['v-0358', 'v-0359']),
  makeSentence(7, 10, '母に電話をかけます。', 'ははにでんわをかけます。', '给母亲打电话。', '母に＿＿。', ['電話をかけます', 'でんわをかけます'], ['v-0372', 'v-0378'])
];
