import { makeSentence } from './factory';

export const lesson09Sentences = [
  makeSentence(9, 1, '私は日本料理が好きです。', 'わたしはにほんりょうりがすきです。', '我喜欢日本料理。', '私は日本料理が＿＿です。', ['好き', 'すき'], ['v-0446', 'v-0447']),
  makeSentence(9, 2, '子供はスポーツが好きです。', 'こどもはすぽーつがすきです。', '孩子喜欢运动。', '子供は＿＿が好きです。', ['スポーツ'], ['v-0450', 'v-0453', 'v-0447']),
  makeSentence(9, 3, '漢字が少し分かります。', 'かんじがすこしわかります。', '懂一点汉字。', '漢字が少し＿＿。', ['分かります', 'わかります'], ['v-0475', 'v-0448', 'v-0449']),
  makeSentence(9, 4, '妻は歌が上手です。', 'つまはうたがじょうずです。', '妻子很会唱歌。', '妻は歌が＿＿です。', ['上手', 'じょうず'], ['v-0489', 'v-0482', 'v-0455']),
  makeSentence(9, 5, '夫は野球が下手です。', 'おっとはやきゅうがへたです。', '丈夫不擅长棒球。', '夫は野球が＿＿です。', ['下手', 'へた'], ['v-0492', 'v-0478', 'v-0490']),
  makeSentence(9, 6, '約束がありますから、時間がありません。', 'やくそくがありますから、じかんがありません。', '因为有约，所以没有时间。', '約束がありますから、＿＿がありません。', ['時間', 'じかん'], ['v-0470', 'v-0459', 'v-0460']),
  makeSentence(9, 7, '私はカラオケが嫌いです。', 'わたしはからおけがきらいです。', '我不喜欢卡拉OK。', '私はカラオケが＿＿です。', ['嫌い', 'きらい'], ['v-0476', 'v-0493']),
  makeSentence(9, 8, 'クラシック音楽が好きです。', 'くらしっくおんがくがすきです。', '我喜欢古典音乐。', 'クラシック音楽が＿＿です。', ['好き', 'すき'], ['v-0464', 'v-0481', 'v-0447']),
  makeSentence(9, 9, '平仮名がよく分かります。', 'ひらがながよくわかります。', '很懂平假名。', '平仮名がよく＿＿。', ['分かります', 'わかります'], ['v-0473', 'v-0485', 'v-0449']),
  makeSentence(9, 10, '今度、一緒にコンサートへ行きませんか。', 'こんど、いっしょにこんさーとへいきませんか。', '下次一起去音乐会好吗？', '今度、一緒に＿＿へ行きませんか。', ['コンサート'], ['v-0471', 'v-0465'])
];
