import { makeSentence } from './factory';

export const lesson02Sentences = [
  makeSentence(2, 1, 'これは辞書です。', 'これはじしょです。', '这是字典。', 'これは＿＿です。', ['辞書', 'じしょ'], ['v-0043', 'v-0044']),
  makeSentence(2, 2, 'それは傘です。', 'それはかさです。', '那是伞。', 'それは＿＿です。', ['傘', 'かさ'], ['v-0045', 'v-0046']),
  makeSentence(2, 3, 'あれは鞄です。', 'あれはかばんです。', '那边那个是包。', 'あれは＿＿です。', ['鞄', 'かばん'], ['v-0057', 'v-0058']),
  makeSentence(2, 4, 'この本は日本語の本です。', 'このほんはにほんごのほんです。', '这本书是日语书。', 'この本は＿＿の本です。', ['日本語', 'にほんご'], ['v-0047', 'v-0073', 'v-0074']),
  makeSentence(2, 5, 'これは私の名刺です。', 'これはわたしのめいしです。', '这是我的名片。', 'これは私の＿＿です。', ['名刺', 'めいし'], ['v-0043', 'v-0054']),
  makeSentence(2, 6, 'その時計は田中さんのです。', 'そのとけいはたなかさんのです。', '那块表是田中先生的。', 'その＿＿は田中さんのです。', ['時計', 'とけい'], ['v-0091', 'v-0077']),
  makeSentence(2, 7, 'あのカメラは誰のですか。', 'あのかめらはだれのですか。', '那台相机是谁的？', 'あの＿＿は誰のですか。', ['カメラ', 'かめら'], ['v-0092', 'v-0079']),
  makeSentence(2, 8, 'これは英語の雑誌です。', 'これはえいごのざっしです。', '这是英语杂志。', 'これは英語の＿＿です。', ['雑誌', 'ざっし'], ['v-0043', 'v-0086', 'v-0055']),
  makeSentence(2, 9, 'その鍵は私のです。', 'そのかぎはわたしのです。', '那把钥匙是我的。', 'その＿＿は私のです。', ['鍵', 'かぎ'], ['v-0091', 'v-0059']),
  makeSentence(2, 10, 'これは何ですか。', 'これはなんですか。', '这是什么？', 'これは＿＿ですか。', ['何', 'なん'], ['v-0043', 'v-0053'])
];
