import { makeSentence } from './factory';

export const lesson05Sentences = [
  makeSentence(5, 1, '来週、京都へ行きます。', 'らいしゅう、きょうとへいきます。', '下周去京都。', '来週、京都へ＿＿。', ['行きます', 'いきます'], ['v-0248', 'v-0220', 'v-0221']),
  makeSentence(5, 2, 'タクシーで駅へ行きます。', 'たくしーでえきへいきます。', '坐出租车去车站。', '＿＿で駅へ行きます。', ['タクシー'], ['v-0222', 'v-0256', 'v-0221']),
  makeSentence(5, 3, '家族と奈良へ行きます。', 'かぞくとならへいきます。', '和家人去奈良。', '家族と＿＿へ行きます。', ['奈良', 'なら'], ['v-0224', 'v-0226', 'v-0221']),
  makeSentence(5, 4, '新幹線で大阪へ行きます。', 'しんかんせんでおおさかへいきます。', '乘新干线去大阪。', '＿＿で大阪へ行きます。', ['新幹線', 'しんかんせん'], ['v-0227', 'v-0221']),
  makeSentence(5, 5, '友達は明日来ます。', 'ともだちはあしたきます。', '朋友明天来。', '友達は明日＿＿。', ['来ます', 'きます'], ['v-0247', 'v-0225']),
  makeSentence(5, 6, '一人で家へ帰ります。', 'ひとりでいえへかえります。', '一个人回家。', '一人で家へ＿＿。', ['帰ります', 'かえります'], ['v-0261', 'v-0223']),
  makeSentence(5, 7, '誕生日は五月十日です。', 'たんじょうびはごがつとおかです。', '生日是五月十日。', '誕生日は五月＿＿です。', ['十日', 'とおか'], ['v-0233', 'v-0229', 'v-0272']),
  makeSentence(5, 8, '先月、九州へ行きました。', 'せんげつ、きゅうしゅうへいきました。', '上个月去了九州。', '先月、＿＿へ行きました。', ['九州', 'きゅうしゅう'], ['v-0249', 'v-0254']),
  makeSentence(5, 9, '学校まで自転車で行きます。', 'がっこうまでじてんしゃでいきます。', '骑自行车去学校。', '学校まで＿＿で行きます。', ['自転車', 'じてんしゃ'], ['v-0252', 'v-0246', 'v-0221']),
  makeSentence(5, 10, '彼女は電車で来ます。', 'かのじょはでんしゃできます。', '她乘电车来。', '彼女は＿＿で来ます。', ['電車', 'でんしゃ'], ['v-0258', 'v-0234', 'v-0225'])
];
