import { makeSentence } from './factory';

export const lesson01Sentences = [
  makeSentence(1, 1, '私は学生です。', 'わたしはがくせいです。', '我是学生。', '私は＿＿です。', ['学生', 'がくせい'], ['v-0001', 'v-0003']),
  makeSentence(1, 2, '田中さんは会社員です。', 'たなかさんはかいしゃいんです。', '田中先生是公司职员。', '田中さんは＿＿です。', ['会社員', 'かいしゃいん'], ['v-0002', 'v-0004']),
  makeSentence(1, 3, 'あの方は銀行員です。', 'あのかたはぎんこういんです。', '那位是银行职员。', 'あの方は＿＿です。', ['銀行員', 'ぎんこういん'], ['v-0010', 'v-0008']),
  makeSentence(1, 4, '山田さんは医者です。', 'やまださんはいしゃです。', '山田先生是医生。', '山田さんは＿＿です。', ['医者', 'いしゃ'], ['v-0002', 'v-0009']),
  makeSentence(1, 5, '佐藤さんは先生です。', 'さとうさんはせんせいです。', '佐藤老师是教师。', '佐藤さんは＿＿です。', ['先生', 'せんせい'], ['v-0002', 'v-0013']),
  makeSentence(1, 6, '私は中国人です。', 'わたしはちゅうごくじんです。', '我是中国人。', '私は＿＿です。', ['中国人', 'ちゅうごくじん'], ['v-0001', 'v-0025']),
  makeSentence(1, 7, 'あの人は研究者です。', 'あのひとはけんきゅうしゃです。', '那个人是研究人员。', 'あの人は＿＿です。', ['研究者', 'けんきゅうしゃ'], ['v-0027', 'v-0035']),
  makeSentence(1, 8, 'こちらは李さんです。', 'こちらはりさんです。', '这位是李先生。', 'こちらは＿＿です。', ['李さん', 'りさん'], ['v-0020', 'v-0002']),
  makeSentence(1, 9, 'あの方はどなたですか。', 'あのかたはどなたですか。', '那位是哪一位？', 'あの方は＿＿ですか。', ['どなた'], ['v-0010', 'v-0011']),
  makeSentence(1, 10, '失礼ですが、お名前は？', 'しつれいですが、おなまえは？', '不好意思，请问您叫什么名字？', '＿＿、お名前は？', ['失礼ですが', 'しつれいですが'], ['v-0041', 'v-0042'])
];
