import { makeSentence } from './factory';

export const lesson08Sentences = [
  makeSentence(8, 1, '桜は綺麗です。', 'さくらはきれいです。', '樱花很漂亮。', '桜は＿＿です。', ['綺麗', 'きれい'], ['v-0384', 'v-0385']),
  makeSentence(8, 2, '富士山は高いです。', 'ふじさんはたかいです。', '富士山很高。', '富士山は＿＿です。', ['高い', 'たかい'], ['v-0386', 'v-0387']),
  makeSentence(8, 3, '上海は賑やかです。', 'しゃんはいはにぎやかです。', '上海很热闹。', '上海は＿＿です。', ['賑やか', 'にぎやか'], ['v-0393', 'v-0389']),
  makeSentence(8, 4, '寮は古いですが、便利です。', 'りょうはふるいですが、べんりです。', '宿舍虽然旧，但是很方便。', '寮は古いですが、＿＿です。', ['便利', 'べんり'], ['v-0395', 'v-0397', 'v-0398']),
  makeSentence(8, 5, '日本の生活は楽しいです。', 'にほんのせいかつはたのしいです。', '在日本的生活很愉快。', '日本の生活は＿＿です。', ['楽しい', 'たのしい'], ['v-0407', 'v-0408']),
  makeSentence(8, 6, '今日は仕事が忙しいです。', 'きょうはしごとがいそがしいです。', '今天工作很忙。', '今日は仕事が＿＿です。', ['忙しい', 'いそがしい'], ['v-0409', 'v-0411']),
  makeSentence(8, 7, 'このレストランは安いです。', 'このれすとらんはやすいです。', '这家餐厅很便宜。', 'このレストランは＿＿です。', ['安い', 'やすい'], ['v-0431', 'v-0432']),
  makeSentence(8, 8, 'この食べ物は美味しいです。', 'このたべものはおいしいです。', '这个食物很好吃。', 'この食べ物は＿＿です。', ['美味しい', 'おいしい'], ['v-0434', 'v-0422']),
  makeSentence(8, 9, 'この町は静かです。', 'このまちはしずかです。', '这座城市很安静。', 'この町は＿＿です。', ['静か', 'しずか'], ['v-0423', 'v-0424']),
  makeSentence(8, 10, '山はとても寒いです。', 'やまはとてもさむいです。', '山上非常冷。', '山はとても＿＿です。', ['寒い', 'さむい'], ['v-0388', 'v-0392', 'v-0391'])
];
